Словарь/src/DataProcessors/ЗаполнениеСлогов/ЗаполнениеСлогов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗаполнениеСлогов</name>
</mdclass:DataProcessor>

Словарь/src/Catalogs/Слоги/Слоги.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Слоги</name>
  <attributes>
    <name>НаименованиеНаРусском</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаписьХираганой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаписьКатаканой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Моджи</name>
      <type>
        <types>CatalogRef.Моджи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоставКатакана</name>
    <attributes>
      <name>Моджи</name>
      <type>
        <types>CatalogRef.Моджи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Словарь/src/Catalogs/Моджи/Моджи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Моджи</name>
  <comment>1 символ</comment>
  <predefined>
    <items>
      <name>A</name>
      <description>A</description>
    </items>
    <items>
      <name>Ba</name>
      <description>Ba</description>
    </items>
    <items>
      <name>Be</name>
      <description>Be</description>
    </items>
    <items>
      <name>Bi</name>
      <description>Bi</description>
    </items>
    <items>
      <name>Bo</name>
      <description>Bo</description>
    </items>
    <items>
      <name>Bu</name>
      <description>Bu</description>
    </items>
    <items>
      <name>Chi</name>
      <description>Chi</description>
    </items>
    <items>
      <name>Da</name>
      <description>Da</description>
    </items>
    <items>
      <name>De</name>
      <description>De</description>
    </items>
    <items>
      <name>Do</name>
      <description>Do</description>
    </items>
    <items>
      <name>Dzu</name>
      <description>Dzu</description>
    </items>
    <items>
      <name>E</name>
      <description>E</description>
    </items>
    <items>
      <name>Fu</name>
      <description>Fu</description>
    </items>
    <items>
      <name>Ga</name>
      <description>Ga</description>
    </items>
    <items>
      <name>Ge</name>
      <description>Ge</description>
    </items>
    <items>
      <name>Gi</name>
      <description>Gi</description>
    </items>
    <items>
      <name>Go</name>
      <description>Go</description>
    </items>
    <items>
      <name>Gu</name>
      <description>Gu</description>
    </items>
    <items>
      <name>Ha</name>
      <description>Ha</description>
    </items>
    <items>
      <name>He</name>
      <description>He</description>
    </items>
    <items>
      <name>Hi</name>
      <description>Hi</description>
    </items>
    <items>
      <name>Ho</name>
      <description>Ho</description>
    </items>
    <items>
      <name>I</name>
      <description>I</description>
    </items>
    <items>
      <name>Dzi</name>
      <description>Ji</description>
    </items>
    <items>
      <name>Ji</name>
      <description>Ji</description>
    </items>
    <items>
      <name>Ka</name>
      <description>Ka</description>
    </items>
    <items>
      <name>Ke</name>
      <description>Ke</description>
    </items>
    <items>
      <name>Ki</name>
      <description>Ki</description>
    </items>
    <items>
      <name>Ko</name>
      <description>Ko</description>
    </items>
    <items>
      <name>Ku</name>
      <description>Ku</description>
    </items>
    <items>
      <name>Ma</name>
      <description>Ma</description>
    </items>
    <items>
      <name>Me</name>
      <description>Me</description>
    </items>
    <items>
      <name>Mi</name>
      <description>Mi</description>
    </items>
    <items>
      <name>Mo</name>
      <description>Mo</description>
    </items>
    <items>
      <name>Mu</name>
      <description>Mu</description>
    </items>
    <items>
      <name>N</name>
      <description>N</description>
    </items>
    <items>
      <name>Na</name>
      <description>Na</description>
    </items>
    <items>
      <name>Ne</name>
      <description>Ne</description>
    </items>
    <items>
      <name>Ni</name>
      <description>Ni</description>
    </items>
    <items>
      <name>No</name>
      <description>No</description>
    </items>
    <items>
      <name>Nu</name>
      <description>Nu</description>
    </items>
    <items>
      <name>O</name>
      <description>O</description>
    </items>
    <items>
      <name>Pa</name>
      <description>Pa</description>
    </items>
    <items>
      <name>Pe</name>
      <description>Pe</description>
    </items>
    <items>
      <name>Pi</name>
      <description>Pi</description>
    </items>
    <items>
      <name>Po</name>
      <description>Po</description>
    </items>
    <items>
      <name>Pu</name>
      <description>Pu</description>
    </items>
    <items>
      <name>Ra</name>
      <description>Ra</description>
    </items>
    <items>
      <name>Re</name>
      <description>Re</description>
    </items>
    <items>
      <name>Ri</name>
      <description>Ri</description>
    </items>
    <items>
      <name>Ro</name>
      <description>Ro</description>
    </items>
    <items>
      <name>Ru</name>
      <description>Ru</description>
    </items>
    <items>
      <name>Sa</name>
      <description>Sa</description>
    </items>
    <items>
      <name>Se</name>
      <description>Se</description>
    </items>
    <items>
      <name>Shi</name>
      <description>Shi</description>
    </items>
    <items>
      <name>So</name>
      <description>So</description>
    </items>
    <items>
      <name>Su</name>
      <description>Su</description>
    </items>
    <items>
      <name>Ta</name>
      <description>Ta</description>
    </items>
    <items>
      <name>Te</name>
      <description>Te</description>
    </items>
    <items>
      <name>To</name>
      <description>To</description>
    </items>
    <items>
      <name>Tsu</name>
      <description>Tsu</description>
    </items>
    <items>
      <name>U</name>
      <description>U</description>
    </items>
    <items>
      <name>Wa</name>
      <description>Wa</description>
    </items>
    <items>
      <name>Wo</name>
      <description>Wo</description>
    </items>
    <items>
      <name>Ya</name>
      <description>Ya</description>
    </items>
    <items>
      <name>Yo</name>
      <description>Yo</description>
    </items>
    <items>
      <name>Yu</name>
      <description>Yu</description>
    </items>
    <items>
      <name>Za</name>
      <description>Za</description>
    </items>
    <items>
      <name>Ze</name>
      <description>Ze</description>
    </items>
    <items>
      <name>Zo</name>
      <description>Zo</description>
    </items>
    <items>
      <name>Zu</name>
      <description>Zu</description>
    </items>
  </predefined>
  <attributes>
    <name>НаименованиеНаРусском</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Юникод</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЮникодПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоКатакана</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоМиниСимвол</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Словарь/src/DataProcessors/ЗаполнениеСлогов/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет справочник "Слоги" на основе соответствий ромаджи-кириллицы и ромаджи-данным слогов.
// TODO - проверить что слоги уже созданы
Процедура ЗаполнитьСлоги() Экспорт
	
	СоответствиеРК = АзбукаВызовСервера.СоответствиеРомаджиКириллицы();
	СоответствиеРДС = АзбукаВызовСервера.СоответствиеРомаджиДаннымСлогов();
	Слоги = Слоги();
	
	ТаблицаМоджи = ТаблицаМоджи(Слоги, СоответствиеРДС);
	
	НачатьТранзакцию();
	Для Каждого Элемент Из СоответствиеРДС Цикл
		
		Отбор = Новый Структура("Наименование", Элемент.Ключ);
		СтрокиСлоги = Слоги.НайтиСтроки(Отбор);
		Если СтрокиСлоги.Количество() Тогда
			Продолжить;
		КонецЕсли;
		
		СлогОбъект = Справочники.Слоги.СоздатьЭлемент();
		СлогОбъект.Наименование = Элемент.Ключ;
		СлогОбъект.НаименованиеНаРусском = СоответствиеРК.Получить(Элемент.Ключ);
		Для Каждого Моджи Из Элемент.Значение Цикл
			МоджиСсылка = НайтиМоджиВТаблице(ТаблицаМоджи, Моджи, Ложь);
			Если НЕ ЗначениеЗаполнено(МоджиСсылка) Тогда
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = "Не найден моджи хираганы " + Моджи.Наименование;
				Сообщение.Сообщить();
				ОтменитьТранзакцию();
				Возврат;
			КонецЕсли;
			НоваяСтрока = СлогОбъект.Состав.Добавить();
			НоваяСтрока.Моджи = МоджиСсылка;
			
			МоджиСсылка = НайтиМоджиВТаблице(ТаблицаМоджи, Моджи, Истина);
			Если НЕ ЗначениеЗаполнено(МоджиСсылка) Тогда
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = "Не найден моджи катаканы " + Моджи.Наименование;
				Сообщение.Сообщить();
				ОтменитьТранзакцию();
				Возврат;
			КонецЕсли;
			НоваяСтрока = СлогОбъект.СоставКатакана.Добавить();
			НоваяСтрока.Моджи = МоджиСсылка;
			
		КонецЦикла;
		СлогОбъект.Записать();
		
	КонецЦикла;
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЗаполнитьСсылкиМоджи(ТаблицаМоджи)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Моджи.Ссылка КАК Ссылка,
	|	Моджи.Наименование КАК Наименование,
	|	Моджи.ЭтоКатакана КАК ЭтоКатакана,
	|	Моджи.ЭтоМиниСимвол КАК ЭтоМиниСимвол
	|ИЗ
	|	Справочник.Моджи КАК Моджи
	|ГДЕ
	|	НЕ Моджи.ПометкаУдаления
	|	И (Моджи.Наименование, Моджи.ЭтоКатакана, Моджи.ЭтоМиниСимвол) В
	|		(ВЫБРАТЬ
	|			Т.Наименование,
	|			Т.ЭтоКатакана,
	|			Т.ЭтоМиниСимвол
	|		ИЗ
	|			&ТаблицаМоджи КАК Т)";
	
	Запрос.УстановитьПараметр("ТаблицаМоджи", ТаблицаМоджи);
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции

Функция НайтиМоджиВТаблице(ТаблицаМоджи, Моджи, ЭтоКатакана)
	
	СтрокиТаблицы = ТаблицаМоджи.НайтиСтроки(
		Новый Структура("Наименование, ЭтоКатакана, ЭтоМиниСимвол", Моджи.Наименование, ЭтоКатакана, Моджи.ЭтоМиниСимвол));
	Если СтрокиТаблицы.Количество() Тогда
		Возврат СтрокиТаблицы[0].Ссылка;
	КонецЕсли;
	Возврат Справочники.Моджи.ПустаяСсылка();
КонецФункции

Функция ТаблицаМоджи(ТаблицаСлоги, СоответствиеРДС)
	
	ТаблицаМоджи = Новый ТаблицаЗначений;
	ТаблицаМоджи.Колонки.Добавить("Ссылка", Новый ОписаниеТипов("СправочникСсылка.Моджи"));
	ТаблицаМоджи.Колонки.Добавить("Наименование", Новый ОписаниеТипов("Строка"));
	ТаблицаМоджи.Колонки.Добавить("ЭтоКатакана", Новый ОписаниеТипов("Булево"));
	ТаблицаМоджи.Колонки.Добавить("ЭтоМиниСимвол", Новый ОписаниеТипов("Булево"));
	
	Для Каждого Элемент Из СоответствиеРДС Цикл
		
		Отбор = Новый Структура("Наименование", Элемент.Ключ);
		СтрокиСлоги = ТаблицаСлоги.НайтиСтроки(Отбор);
		Если СтрокиСлоги.Количество() Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого Моджи Из Элемент.Значение Цикл
			
			СтрокаДляПоиска = ТаблицаМоджи.Добавить();
			СтрокаДляПоиска.Наименование = Моджи.Наименование;
			СтрокаДляПоиска.ЭтоКатакана = Ложь;
			СтрокаДляПоиска.ЭтоМиниСимвол = Моджи.ЭтоМиниСимвол;
		
			СтрокаДляПоиска2 = ТаблицаМоджи.Добавить();
			СтрокаДляПоиска2.Наименование = Моджи.Наименование;
			СтрокаДляПоиска2.ЭтоКатакана = Истина;
			СтрокаДляПоиска2.ЭтоМиниСимвол = Моджи.ЭтоМиниСимвол;
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ЗаполнитьСсылкиМоджи(ТаблицаМоджи);
КонецФункции

Функция Слоги()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Слоги.Ссылка КАК Ссылка,
	|	Слоги.Наименование КАК Наименование
	|ИЗ
	|	Справочник.Слоги КАК Слоги
	|ГДЕ
	|	Слоги.ПометкаУдаления = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции

#КонецОбласти
#Иначе 
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
